Revit 2024 API
Alignment.GetAlignments Method (View)
 Returns all alignments visible in the given view.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public static ICollection<Alignment> GetAlignments(
	View view
)
Visual Basic
Public Shared Function GetAlignments ( _
	view As View _
) As ICollection(Of Alignment)
Visual C++
public:
static ICollection<Alignment^>^ GetAlignments(
	View^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View
The view for which the alignments are returned.
See Also
Alignment Class
GetAlignments Overload
Autodesk.Revit.DB.Infrastructure Namespace